{
  "practice_name": "<b>Работа с удалёнными репозиториями в Git</b>\n",
  "tasks": {
    "task1": {
      "task_text": [
        "🔹 <b>Задание 1: Создание удалённого репозитория</b>\n",
        "📌 <b>Задача:</b>\n",
        "Если Вы ещё не зарегистрировались на GitHub, то сейчас самая пора это сделать 🕰️!",
        "После регистрации создайте публичный пустой удалённый Git-репозиторий на GitHub ✨.",
        "Теперь склонируйте его к себе на компьютер в любое место и пришлите вывод следующей команды, выполненной из склонированного репозитория:\n",
        "<pre><code>git remote -v</code></pre>\n\n",
        "Примечание: если вывод пустой, то отправьте символ \"-\" (без кавычек)"
      ],
      "expected": "origin  https://github.com/....git (fetch)\norigin  https://github.com/....git (push)",
      "errors": {
        "invalid_directory": "❌ fatal: not a git repository (or any of the parent directories)",
        "empty_output": "❌ Пустой вывод",
        "other": "❌ Другое"
      },
      "hints": {
        "invalid_directory": "💡 Вы не находитесь в нужной папке. Убедитесь, что перешли в неё через cd перед выполнением требуемой команды, и отправьте ответ команды ещё раз. 👍",
        "empty_output": "💡 Очевидно, что-то пошло не так. Вероятно, вы находитесь в каком-то git-репозитории, но не в том, что склонировали 🤔. Убедитесь, что команда выполнена из нужной папки и повторите попытку! 🎉",
        "other": "💡 Убедитесь, что правильно прочитали задание и отправили вывод требуемой команды. Попробуйте отправить ответ повторно 👍"
      }
    },
    "task2": {
      "task_text": [
        "🔹 <b>Задание 2: Первый push</b>\n",
        "📌 <b>Задача:</b>\n",
        "Создайте файл file.txt в том же самом репозитории. Зафиксируйте изменения командами <code>git add</code> и <code>git commit</code>, назвав коммит так: \"Add file.txt\" (это Вы изучали на 3-ем уроке 🧐).", 
        "А теперь отправьте изменения на ветку main с помощью команды <code>git push origin main</code>. А теперь пришлите вывод следующей команды:\n",
        "<pre><code>git log origin/main</code></pre>"
      ],
      "expected": "commit ... (HEAD -> main, origin/main, origin/HEAD)\nAuthor: Name Surname <example@example.com>\nDate:   Sun May 25 21:52:45 2025 +0300\n\n    Add file.txt",
      "errors": {
        "invalid_directory": "❌ fatal: not a git repository (or any of the parent directories)",
        "invalid_names": "❌ fatal: ambiguous argument 'origin/main': unknown revision or path not in the working tree. ...",
        "invalid_message": "❌ Неверное сообщение коммита",
        "other": "❌ Другое"
      },
      "hints": {
        "invalid_directory": "💡 Вы не находитесь в нужной папке 👀. Убедитесь, что перешли в неё через cd перед выполнением требуемой команды.",
        "invalid_names": "💡 Это сообщение указывает на то, что ветки main на удаленном репозитории origin обнаружено не было. Варианта два... 💁‍♂️ Первый - Вы назвали репозиторий или ветку иначе, второй - Вы находитесь не в том репозитории. Убедитесь, что Вы всё сделали правильно и отправьте ответ команды ещё раз ✊",
        "invalid_message": "💡 Текст последнего коммита на удаленном репозитории отличается... Вариантов, почему может быть так, несколько 😁. Во-первых, возможно, Вы просто невнимательно прочитали задание 🙄. Во-вторых, возможно, это какой-то другой коммит (например, Вы случайно сделали какой-то коммит до этого), а Ваш текущий коммит не был зафиксирован 🫤. Исправьте ошибку любым известным Вам способом (например, удаление коммита) и повторите попытку. 😊",
        "other": "💡 Что-то явно пошло не так... Вам стоит убедиться, что Вы внимательно прочитали задание и отправили вывод требуемой команды. Попробуйте отправить ответ повторно 👍"
      }
    },
    "task3": {
      "task_text": [
        "🔹 <b>Задание 3: Обновляем локальный репозиторий</b>\n",
        "📌 <b>Задача:</b>\n",
        "Отлично! Теперь перейдите в GitHub и измените там ваш файл file.txt (например, добавьте туда пару строк текста).", 
        "Вернитесь в локальный репозиторий и выполните эту команду: <code>git pull</code>. Теперь отправьте вывод этой команды:\n",
        "<pre><code>git status</code></pre>"
      ],
      "expected": "On branch master\nYour branch is up to date with 'origin/master'.\n\nnothing to commit, working tree clean",
      "errors": {
        "invalid_directory": "❌ fatal: not a git repository (or any of the parent directories)",
        "branch_is_behind": "❌ Your branch is behind",
        "connection_problem": "❌ fatal: unable to access ...",
        "other": "❌ Другое"
      },
      "hints": {
        "invalid_directory": "💡 Вы выполнили команду, не находясь в репозитории. Убедитесь, что перешли в репозиторий через cd перед выполнением требуемой команды, и отправьте ответ команды ещё раз. 👍",
        "branch_is_behind": "💡 Ветка нуждается в обновлении 🔝. Очевидно, что команда <code>git pull</code> закончилась с ошибками и локальный репозиторий обновлен не был... Попробуйте повторить попытку загрузки изменений с удалённого репозитория и отправьте новый вывод команды <code>git status</code>. 😊",
        "connection_problem": "💡 Похоже у Вас есть проблемы с интернетом 😔. Но это не так страшно, проверьте подключение к сети Интернет, правильность URL удаленного репозитория (например, при помощи команды <code>git remote get-url --all origin</code>) и повторите отправку ответа 😌",
        "other": "💡 Вероятнее всего Вы невнимательно прочитали задание. Внимательно перечитайте все шаги, убедитесь, что прислали вывод нужной команды. И, конечно, повторите отправку ответа 👍"
      }
    },
    "task4": {
      "task_text": [
        "🔹 <b>Задание 4: Создание ветки</b>\n",
        "📌 <b>Задача:</b>\n",
        "Создайте при помощи веб-интерфейса в GitHub новую ветку и назовите её newbranch (главная страница репозитория -> кнопка branch над содержанием репозитория -> New branch).", 
        "Теперь вновь перейдите в локальный репозиторий, загрузите изменения (<code>git pull</code>) и выполните следующую команду, прикрепив её вывод:\n",
        "<pre><code>git branch -r</code></pre>"
      ],
      "expected": "  origin/main\n  origin/newbranch",
      "errors": {
        "invalid_directory": "❌ fatal: not a git repository (or any of the parent directories)",
        "branch_missing": "❌ origin/newbranch отсутствует",
        "other": "❌ Другое"
      },
      "hints": {
        "invalid_directory": "💡 Вы не находитесь в репозитории 👀. Убедитесь, что выполняете команду из репозитория или перейдите в него с помощью cd. И повторите отправку ответа! 🎉",
        "branch_missing": "💡 Похоже, Вы не выполнили загрузку изменений с сервера или ветка не была создана. Выполнить команду <code>git pull</code> очень важно в этом задании (❗), поэтому попробуйте сделать это ещё раз и проверьте наличие ветки на удаленном репозитории 💁‍♂️. Конечно же, повторите также отправку ответа! 😊",
        "other": "💡 Вам следует убедиться, что Вы последовательно выполнили все задания. Проверьте, что прочитали задание внимательно и отправили вывод нужной команды. Если ветка была создана, то после загрузки изменений она должна была отобразиться в выводе 🤫! Исправьте неточности и повторите отправку ответа. 👍"
      }
    },
    "task5": {
      "task_text": [
        "🔹 <b>Задание 5: Сравнение веток</b>\n",
        "📌 <b>Задача:</b>\n",
        "Последние задание будет, пожалуй, самое простое! Измените файл file.txt, добавив строку \"The last task\" (без кавычек) и отправьте вывод этой команды:\n",
        "<pre><code>git diff main origin/main</code></pre>\n\n",
        "Примечание: если вывод пустой, то отправьте символ \"-\" (также без кавычек)"
      ],
      "expected": "... +The last task ...",
      "errors": {
        "invalid_directory": "❌ fatal: not a git repository (or any of the parent directories)",
        "empty_output": "❌ Пустой вывод",
        "invalid_text": "❌ Добавлен другой текст",
        "other": "❌ Другое"
      },
      "hints": {
        "invalid_directory": "💡 Команда выполнена вне репозитория 👀. Убедитесь, что выполняете команду из него (в случае необходимости измените текущее положение с помощью cd). Повторите отправку ответа! 👌",
        "empty_output": "💡 Скорее всего Вы не изменили file.txt 🫤. Задание очень простое, перечитайте его внимательно и повторите отправку ответа! 😊",
        "invalid_text": "💡 Вы неплохо справились, но явно есть неточность в добавленном тексте... Перечитайте задание, убедитесь, что всё сделали правильно, и повторите отправку ответа! 🎉",
        "other": "💡 Убедитесь, что отправили вывод нужной команды 🧐. Проверьте правильность выполнения команды и что вы работаете в нужной директории. Повторите отправку ответа! 👆"
      }
    }
  }
}
